import 'package:flutter/material.dart';
class AGRO extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
        backgroundColor: Colors.greenAccent,
        body: SafeArea(
          child: ListView(

            children: [
              SizedBox(height: 30,),

              Container(
                height: 200,
                decoration: BoxDecoration(
                  shape: BoxShape.rectangle,
                  image: DecorationImage(
                    image: AssetImage("images/agrotech.PNG"),
                    fit: BoxFit.fill,
                  ),
                ),

              ),


              SizedBox(height: 30,),
              Text("Subject Review: Agrotechnology  ",style: TextStyle(fontSize: 24,fontWeight: FontWeight.bold),),
              SizedBox(height: 30,),
              Text("খুলনা বিশ্ববিদ্যালয়ের এগ্রিকালচারকে আমাদের শিক্ষকেরা আদর করে ডাকেন এগ্রোটেকনোলজি। এগ্রোটেকনোলজি ডিসিপ্লিনের যাত্রা শুরু ১৯৯৬ সালে, মাত্র ৩২ জন শিক্ষার্থীকে নিয়ে। এরপর এগ্রোটেকনোলজি ডিসিপ্লিনকে আর পেছনে ফিরে তাকাতে হয়নি। যেখানেই এগ্রোটেক, সেখানেই জয়জয়কার! \n\n বাংলাদেশ কৃষিপ্রধান দেশ, কথাটা আগে আমরা পাঠ্যবইয়ে বহুবার পড়ে এসেছি। তবে আমরা যারা রোডসাইডে ঘুরে বেড়াই, গ্রামেগঞ্জে থাকি তারা বুঝতে পারি কথাটির সার্থকতা। কৃষিই আমাদের দেশের মানুষের প্রায় সকল প্রকারের চাহিদা মিটিয়ে আসছে। একটা সময় ছিলো আমরা খাদ্যে স্বয়ংসম্পূর্ণ ছিলাম না। কৃষিবিদদের অবদানে আমরা আর পিছিয়ে নেই। ক্রমাগত এগিয়ে চলেছি। কিছুদিন আগে একটা রিপোর্ট পড়েছিলাম, খরা সহ্য করতে পারে এবং বেশি প্রোটিন আছে এমন একটি নতুন জাতের ধান উদ্ভাবন করেছেন বাংলাদেশের বিজ্ঞানীরা। রিপোর্টের লিংক কমেন্টে দিচ্ছি। \n\n এগ্রোটেকনোলজি ডিসিপ্লিনে এগ্রিকালচারই পড়ানো হয়, ডিগ্রিও একই B.Sc.Ag (Hons.)। শুধু নামটাই একটু ভিন্ন। এগ্রোনমি, হর্টিকালচার, এনিম্যাল এন্ড পোল্ট্রি সায়েন্স, সয়েল সায়েন্স, এগ্রোফরেস্ট্রি, এক্সটেনশন, এন্টোমলজি, ইকোনোমিক্সসহ আরো অনেক কোর্সই পড়ানো হয় এখানে। ডিসিপ্লিনটির মূল উদ্দেশ্য দক্ষ কৃষিবিদ গড়ে তোলা যাতে করে শিক্ষার্থীরা শিক্ষাজীবন শেষে দেশের উন্নয়নে কাজ করতে পারে। স্কলারশিপ নিয়ে বাইরে যাবার সুযোগ অফুরন্ত।  ",style: TextStyle(fontSize: 20,fontWeight: FontWeight.w400),),



              SizedBox(height: 30,),
              Text("চাকুরীর বাজার ",style: TextStyle(fontSize: 24,fontWeight: FontWeight.bold),),
              SizedBox(height: 30,),
              Text("এটা নিয়ে নতুন করে কিছু বলার নেই। বাকৃবি, শেকৃবির একজন গ্রাজুয়েটও যেমন চাকুরী পাবেন, এগ্রোটেকনোলজি পড়েও একই চাকুরী পাওয়া যায়। বিসিএস দিয়ে এখান থেকে অনেকেই কৃষি কর্মকর্তা হচ্ছেন। কৃষিবিদদের খুবই পছন্দের জায়গা হলো সরকারি কৃষি গবেষণা প্রতিষ্ঠান। বাংলাদেশ কৃষি গবেষণা ইনস্টিটিউট, বাংলাদেশ পরমাণু কৃষি গবেষণা প্রতিষ্ঠান, বাংলাদেশ ধান গবেষণা ইনস্টিটিউট, বাংলাদেশ ইক্ষু গবেষণা ইনস্টিটিউট, বাংলাদেশ তুলা গবেষণা ইনস্টিটিউট, মৃত্তিকা গবেষণা উন্নয়ন প্রতিষ্ঠান, বাংলাদেশ পাট গবেষণা ইনস্টিটিউট, বাংলাদেশ বন গবেষণা ইনস্টিটিউট এবং বাংলাদেশ চা গবেষণা ইনস্টিটিউটে বৈজ্ঞানিক কর্মকর্তা হয়ে যোগ দিচ্ছেন।\n\n বাংলাদেশ কর্ম কমিশনের (বিসিএস) পরীক্ষায় কৃষিবিদেরা টেকনিক্যাল ও সাধারণ উভয় ক্যাডারে আবেদনের সুযোগ পাওয়ায় দেশের সব কর্মক্ষেত্রে যোগ দিতে পারবেন। তা ছাড়া কৃষি ব্যাংকগুলোতে অগ্রাধিকারসহ দেশের সরকারি ও বেসরকারি সব ব্যাংকে চাকরি করছেন কৃষিবিদেরা। বিভিন্ন সরকারি ট্রেনিং ইনস্টিটিউটে লেকচারার হয়ে যোগ দেওয়া যায়।\n\n এ ছাড়া অনেক কৃষিবিদ উন্নয়নমূলক প্রতিষ্ঠানে কাজ করছেন। বাংলাদেশ পল্লী উন্নয়ন বোর্ড, বাংলাদেশ একাডেমি ফর রুরাল ডেভেলপমেন্ট, পল্লী উন্নয়ন একাডেমি, বাংলাদেশ বিজ্ঞান ও শিল্প গবেষণা কাউন্সিলেও কৃষিবিদরা কাজ করছেন। এ ছাড়া সার কারখানা, চিনিকল, বীজ প্রত্যয়ন এজেন্সি, কীটনাশক তৈরির কারখানা, ব্র্যাক, ব্রিটিশ আমেরিকান টোব্যাকো কোম্পানিতেও কাজ করছেন।\n\n তবে আমি বলব, চাকুরীর বাজার যাইহোক না কেন, আমাদের এক স্যার বলেছেন, “Survival for the fittest.” আমার ডিসিপ্লিনের এক প্রিয় স্যারও অনেকটা একই কথা বলেছেন, “এগ্রিকালচার পড়ে ভাব নেবার কিছু নেই। সবাই কি সফল হয়েছে এটা পড়ে?” আমার ডিসিপ্লিনের এই দুজন শিক্ষক সুস্পষ্টভাবে ইঙ্গিত দিচ্ছেন নিজেদের দক্ষতা বাড়াবার প্রতি। ফেসবুকে একটা নোট পড়েছিলাম, দক্ষতাই টাকা। সত্যি বলতে গেলে, ভার্সিটি লাইফে যে নিজেকে গড়ে তুলতে পারবে, সে সফল হবেই। চাকুরীর পেছনে তাকে দৌড়াতে হবে না, চাকুরীই তার পিছে দৌড়াবে!",style: TextStyle(fontSize: 20,fontWeight: FontWeight.w400),),



            ],

          ),
        )
    );
  }
}
