import 'package:flutter/material.dart';
class BACHELOR extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
        backgroundColor: Colors.greenAccent,
        body: SafeArea(
          child: ListView(

            children: [
              SizedBox(height: 30,),

              Container(
                height: 200,
                decoration: BoxDecoration(
                  shape: BoxShape.rectangle,
                  image: DecorationImage(
                    image: AssetImage("images/bachelor.png"),
                    fit: BoxFit.fill,
                  ),
                ),

              ),


              SizedBox(height: 30,),
              Text(" Bachelor of education",style: TextStyle(fontSize: 24,fontWeight: FontWeight.bold),),
              SizedBox(height: 30,),
              Text("এডুকেশনে পড়তে চাইলে এখানে সর্বপ্রথম কষ্ট করার মানষিকতা তৈরি করে তোমাকে প্রবেশ করতে হবে। শিক্ষা বিষয়ের পাশাপাশি তোমাকে তোমার স্ট্রিম অনুযায়ি বিষয়াদি যেমন বাংলা ভাষা,ইংরেজি ভাষা, মনোবিজ্ঞান, পদার্থবিজ্ঞান, রসায়ন, গণিত কিংবা জীববিজ্ঞান কোর্স অংশগ্রহণ করতে হবে। \n\n ব্যক্তির বিকাশ এবং সমাজ ও দেশের সামগ্রিক অগ্রগতিতে উচ্চ শিক্ষা গুরুত্বপূর্ণ ভূমিকা পালন করে। জাতির উচ্চাকাংখা পূরণের লক্ষ্যে উচ্চ শিক্ষাই প্রধান অবলম্বন। তাই আমাদের দেশে শিক্ষা ক্ষেত্রে উচ্চ শিক্ষা লাভের সুযোগও রয়েছে বেশ। যে ডিগ্রি ব্যাচেলর-অব-এডুকেশন বা বিএড নামে পরিচিত। পাবলিক বিশ্ববিদ্যালয়, প্রাইভেট বিশ্ববিদ্যালয় সহ বিভিন্ন কলেজে রয়েছে বিএড পড়ার সুযোগ। জাতীয় ও আন্তর্জাতিক পর্যায়ের শিক্ষা বিষায়ক প্রতিষ্ঠানে উন্নত বেতনে কাজ করার সুযোগ রয়েছে এ বিষয় থেকে পাশ করা শিক্ষার্থীদের। যেসব জায়গায় পড়ার সুযোগ রয়েছে। ",style: TextStyle(fontSize: 20,fontWeight: FontWeight.w400),),



              SizedBox(height: 30,),
              Text(" ✈✈উচ্চ শিক্ষার সুযোগ-সুবিধা✈✈",style: TextStyle(fontSize: 24,fontWeight: FontWeight.bold),),
              SizedBox(height: 30,),
              Text("শিক্ষা ক্ষেত্রে উন্নত বিশ্বে উচ্চ শিক্ষার সুবিধা অনেক বেশি। প্রত্যেক বছর শিক্ষার্থীদের বিরাট একটা অংশ বৃত্তি নিয়ে উন্নত দেশে পড়াশুনা করতে যায়। এ ক্ষেত্রে অষ্ট্রেলিয়া, কানাডা, আমেরিকা, যুক্তরাজ্য, জাপান, নিউজিল্যান্ড, ফিলিপাইন ও ভারতের নাম উল্লেখ যোগ্য। পৃথিবীর বিভিন্ন দেশে শিক্ষা বিজ্ঞান বিষয়ক বিভাগ, অনুষদ, ইনস্টিটিউট এমনকি বিশ্ববিদ্যালয় রয়েছে। সেখানে বৃত্তি নিয়ে পড়ার সুযোগ রয়েছে। মূলত বৃত্তির বিষয়টা শিক্ষার্থীর চেষ্টার উপর নির্ভর করে।\n\n উন্নত দেশে যেসব বিশ্ববিদ্যালয়ে শিক্ষায় বৃত্তি দিয়ে থাকে এ গুলোর মাঝে রয়েছে- মোনাস ইউনিভার্সিটি; অস্ট্রেলিয়া, নরোজিয়ান ইউনিভার্সিটি অব লাইফ সাইন্স; নরওয়ে, জর্জ ওয়াশিংটন ইউনিভার্সিটি; যুক্তরাষ্ট্র, ভিক্টোরিয়া ইউনিভার্সিটি; কানাডা, কলোম্বিয়া ইউনিভার্সিটি; যুক্তরাষ্ট্র সহ বিভিন্ন দেশের নামি দামী বিশ্ববিদ্যালয়ে বৃত্তির সুযোগ রয়েছে। ",style: TextStyle(fontSize: 20,fontWeight: FontWeight.w400),),


              SizedBox(height: 30,),
              Text(" 💰💰জব সেক্টর💰💰",style: TextStyle(fontSize: 24,fontWeight: FontWeight.bold),),
              SizedBox(height: 30,),
              Text("পড়ালেখা শেষ করে এবার আমরা আসি জব অপরচুনিটি সম্পর্কে, যেটা সবচাইতে বেশি ইম্পরটেন্ট আর কি। চাকুরীর বাজারেও আগ্রহের কেন্দ্রবিন্দুতেও বর্তমান সময়ে শিক্ষা ও গবেষণা  উপরের সারীতে।ইউ আর সি ইন্সট্রাক্টর, পিটিয়াই ইন্সট্রাক্টর, থানা শিক্ষা অফিসার, উপজেলা একাডেমিক সুপারভাইজার, ডিস্ট্রিক্ট ট্রেনিং কো অর্ডিনেটর, ব্যাংকার (সরকারি ও প্রাইভেট), বাংলাদেশ ব্যাংক, বিভিন্ন স্বায়ত্বশাসিত সরকারি প্রতিষ্ঠানের সহকারী ব্যবস্থাপক ও অন্যান্য, বিভিন্ন এনজিও তে কারিকুলাম ডেভেলপার, লার্নিং ম্যাটেরিয়াল স্পেশালিস্ট, রিসার্চার, প্রাইভেট-পাবলিক ভার্সিটি লেকচারার ক্যাডার-নন ক্যাডার পোস্ট বাদই দিলাম। বিভিন্ন শিক্ষাবোর্ড,ন্যাশনাল + ইন্টারন্যাশনাল এনজিওতে এজুকেশনাল প্রজেক্টে রিসার্চার হিসেবে।সরকারিভাবে পরিচালিত বিভিন্ন প্রজেক্ট, শিক্ষার উন্নয়নে কর্মরত দেশি-বিদেশি এনজিওসমূহ, NCTB, NAEM, NTRCA প্রভৃতি এছাড়া বেসরকারী প্রতিষ্ঠানেও কাজ করার সুযোগ রয়েছে। বর্তমানে বিভিন্ন জাতীয় ও আন্তর্জাতিক এনজিও তাদের শিক্ষামূলক প্রকল্প পরিচালনার ক্ষেত্রে বিএড ও এমএড কোর্স সম্পন্ন দক্ষ জনশক্তি চায়। এগুলোর মধ্যে রয়েছে-Save the Children, US- Aid, AUS-Aid, UNESCO,UNECEF, CAMPE, ব্রাক, প্রশিকা, আহসানিয়া মিশন ইত্যাদি।   বর্তমানে প্রায় সবকটি আন্তর্জাতিক প্রতিষ্ঠানে শিক্ষা বিষয়ক প্রধান হিসেবে কাজ করছে ঢাকা বিশ্ববিদ্যালয়ের আইইআর থেকে পাশ করা শিক্ষার্থীরা।আগামীতে নোবিপ্রবি থেকে তোমরাও এইসব জায়গায় থাকবে। ",style: TextStyle(fontSize: 20,fontWeight: FontWeight.w400),),
            ],

          ),
        )
    );
  }
}
