import 'package:flutter/material.dart';
class BIOTECHNOLOGY extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
        backgroundColor: Colors.greenAccent,
        body: SafeArea(
          child: ListView(

            children: [
              SizedBox(height: 30,),

              Container(
                height: 200,
                decoration: BoxDecoration(
                  shape: BoxShape.rectangle,
                  image: DecorationImage(
                    image: AssetImage("images/biotech.PNG"),
                    fit: BoxFit.fill,
                  ),
                ),

              ),



              SizedBox(height: 30,),
              Text(" Subject Review - Genetic Engineering & Biotechnology",style: TextStyle(fontSize: 24,fontWeight: FontWeight.bold),),
              SizedBox(height: 30,),
              Text(" বিজ্ঞান চর্চার প্রাথমিক যুগের সূচনা ঘটেছিল গণিত চর্চার মধ্য দিয়ে। মধ্যযুগে তা পদার্থবিদ্যার বিকাশে যুগান্তকারী ভূমিকা রাখে। ধীরে ধীরে নিউটন, গ্যালিলিও, আইনস্টাইন, বোরের তত্ত্ব একে আধুনিক যুগে নিয়ে আসে।\n\n কিন্তু, 1920 এর আবিষ্কারের ধারা কিছুটা স্তিমিত হয়ে পড়ে। তখন, বিজ্ঞানীরা ঝুকতে থাকে পরিবেশ, পৃথিবী, মানুষ, জীবজগৎ নিয়ে গবেষণার দিকে।\n\n বর্তমানে একবিংশ শতাব্দীকে তাই নিঃসন্দেহে বলা হচ্ছে The Century of Biological Science. এর কারণ 1972 সালে পল বার্গের রিকম্বিনেন্ট ডিএনএ টেকনোলজি বা জেনেটিক ইঞ্জিনিয়ারিং এর আবিষ্কার।\n\n প্রাণ রসায়ণের সবচেয়ে আধুনিক এ শাখায় জীবনকে সংজ্ঞায়িত করা হয় অণু-পরমাণু পর্যায়ে, একে বলা হয় he Molecular Logic Of Life। A-T-C-G এই মাত্র চারটি হরফে লেখা এ বিষয়কে বলা হয় Language of GOD. জেনেটিক ইঞ্জিনিয়ারিং মূলত ট্রান্সজেনিক (উন্নত বৈশিষ্টধারী) উদ্ভিদ ও প্রাণী সৃষ্টিতে কাজ করে।\n\n নামের শেষে ইঞ্জিনিয়ারিং যোগ করার কারণ হচ্ছে, জীববিজ্ঞানের কেবলমাত্র এ শাখাটিতেই নিজের ইচ্ছামত ডিজাইন করে একটি প্রাণী সৃষ্টি করা যায়, ডিজাইন করা যায় নিজের পছন্দের ই.কোলাই যে কিনা নিজের কথামত উঠবে বসবে। কাজটা অনেকটা একটা কম্পউটার প্রোগ্রাম ডিজাইন করার মত, যা তোমার আদেশ সম্পূর্ণ মেনে চলে।\n\n চিন্তা করে দেখ, ব্যাপারটা একজন আবিষ্কারকের জন্য কতটা রোমাঞ্চকর যখন সম্পূর্ণ জীবন্ত কিছু একটা নিজের ডিজাইন মত কাজ করছে? (Dhaka University এর বাইরেও অন্যান্য বিশ্ববিদ্যালয়ে যেমন, SUST, KU - তে এই সাবজেক্ট আছে।)\n\n খুব গুরুত্বপূর্ণ ব্যাপার হচ্ছে, বিশ্বের অধিকাংশ দেশেই এ বিষয়টির সাথে জুড়ে দেয়া হয় বায়োটেকনোলজিকে। জেনেটিক ইঞ্জিনিয়ারিং এর একটি ক্ষুদ্র অংশ।\n\n বায়োটেকনলজির অন্যান্য শাখা গুলো হল, মাইক্রোবায়োলজি, বায়োকেমিস্ট্রি, বায়োস্ট্যাটিসটিক, ইমিউনোলজি, ওর্গানিক কেমিস্ট্রি, এনজাইমোলজি, ইনসিলিকো (কম্পিউটেশনাল) বায়োলজি, টিস্যু কালচার ইত্যাদি।\n\n কি কি গুণ লাগবে বিশ্বের আধুনিকতম এ বিষয়ে পড়তে? তোমাকে হতে হবে খুবই অভূতপূর্ব চিন্তাবিদ, কঠোর পরিশ্রমী, মানবিক গুণসম্পন্ন বিশেষ করে দেশপ্রেমিক। পাশাপাশি ঝানু হতে হবে জীববিজ্ঞান, জৈব রসায়ন এবং প্রোগ্রমিং এ। চিন্তা করাটা খুব গুরুত্বপূর্ণ কারণ এখানে এমন কিছু করা সম্ভব যা কেউ ভাবতেও পারে না।যেমন, একবার এক বিজ্ঞানী ঠিক করলেন ছাগলের দুধের মধ্যে তিনি মাকড়সার জালের সূতা তৈরি করবেন যা হবে বিশ্বের সবচেয়ে শক্তিশালী সূতা। তিনি সফল হয়েছিলেন জেনেটিক ইঞ্জিনিয়ারিং এর মাধ্যমে এবং সৃষ্টি করেছিলেন বায়োস্টীল! (http://en.wikipedia.org/wiki/Biosteel)\n\n নেচার ম্যাগাজিনের কভারের প্রতিদিনিই জায়গা করে নিচ্ছে জাপান, আমেরিকার জেনেটিক ইঞ্জিনিয়ার রা। টিস্যু কালচার টেকনোলজি নোবেল পেল 2012 সালে!\n\n বায়োকেমিস্টরা তো কেমিস্ট্রির সবগুলো নোবেলই প্রতি বছর পকেটে পুরছে। আমাদের সরকার বর্তমানে এ বিষয়ে গবেষণাতে বাজেট বরাদ্দ দিচ্ছে। দেশের গবেষণাগার গুলো উন্নত হয়ে উঠছে দিন দিন। শিক্ষার্থীদের আগ্রহ-কৌতুহলও গগণচুম্বী।\n\n তাহলে, “ডাক্তারদের ইঞ্জিনিয়ার” হিসেবে 2025 সালের “নেচার” ম্যাগাজিনের প্রচ্ছদে নিজের ছবি কি দেখতে চাও? Remember, the choice is yours!",style: TextStyle(fontSize: 20,fontWeight: FontWeight.w400),),

            ],

          ),
        )
    );
  }
}
