import 'package:flutter/material.dart';
class FISHERIES extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
        backgroundColor: Colors.greenAccent,
        body: SafeArea(
          child: ListView(

            children: [
              SizedBox(height: 30,),

              Container(
                height: 200,
                decoration: BoxDecoration(
                  shape: BoxShape.rectangle,
                  image: DecorationImage(
                    image: AssetImage("images/marinescience.PNG"),
                    fit: BoxFit.fill,
                  ),
                ),

              ),


              SizedBox(height: 30,),
              Text("Subject Review : Fisheries and Marine Science  ",style: TextStyle(fontSize: 24,fontWeight: FontWeight.bold),),
              SizedBox(height: 30,),
              Text(" সাবজেক্ট চয়েজ হিসেবে প্রথম দিকে ফিশারিজ এন্ড মেরিন সাইন্স (ফিমস) দিতে পারো।  নোবিপ্রবিতে ফিশারিজ অন্যতম\nস্বয়ং সম্পূর্ণ ডিপার্টমেন্ট ।\nপ্রজেক্টর ক্লাসরুম,শিক্ষকদের প্রায় সবাই দেশের বাইরের বিভিন্ন নামকরা বিশ্ববিদ্যালয় থেকে উচ্চ ডিগ্রিধারী।আমাদের ডিপার্টমেন্টের জনাব Mohammad Belal Hossain স্যার আন্তর্জাতিক মানের বিজ্ঞানী।  তিনি সম্প্রতি দুইটি অমেরুদন্ডী প্রানী আবিষ্কার করে ইন্টারন্যাশনাল বিভিন্ন জার্নালে বড় বড় বিজ্ঞানীদের পাশে নাম লিখিয়ে ফেলেছেন। ডিপার্টমেন্টের সব স্যাররা অনেকআন্তরিক। এখানে রয়েছে স্বয়ংসম্পূর্ণল্যাব,নিজস্ব সেমিনার লাইব্রেরির সুব্যবস্থা । এই ডিপার্টমেন্ট থেকে পাশকরে অনেকেই অনেক ভালো অবস্থানে আছেন । ",style: TextStyle(fontSize: 20,fontWeight: FontWeight.w400),),


              SizedBox(height: 30,),
              Text("#উচ্চশিক্ষা প্রতিষ্ঠানসমূহ : ",style: TextStyle(fontSize: 24,fontWeight: FontWeight.bold),),
              SizedBox(height: 30,),
              Text("ভাল স্কোর নিয়ে বি.এস-সি ফিশারীজ (অনার্স)ডিগ্রী অর্জনের পর একজন গ্রাজুয়েট দেশের বিভিন্ন বিশ্ববিদ্যালয়ে নিম্নলিখিতভাবে যোগ দিতে পারেন-\n *.বৃত্তিসহ পোষ্ট গ্রাজুয়েট কোর্সে(যেমন এম.এস.) অংশগ্রহণ\n*.বৃত্তিসহ গবেষণামূলক এমফিল/পি-এইচ.ডি. কোর্সে অংশ গ্রহণ.ফিশারীজ অনুষদে শিক্ষক হিসেবে যোগদান\n*.রিসার্চ ফেলো বা গবেষণা সহকারী হিসেবে যোগদানসরকারী সংস্থাসমূহ:বাংলাদেশ সরকারের বিভিন্ন মন্ত্রণালয় ও এর অধীনস্থ বিভিন্ন সংস্থা/অফিস সমূহে ফিশারীজ গ্রাজুয়েটের কাজ করার সুযোগ রয়েছে।যথা-\n*.মৎস্য অধিদপ্তর, মৎস্য ও প্রাণী সম্পদ মন্ত্রণালয়*.বাংলাদেশ মৎস্য সম্পদ গবেষণা কেন্দ্র (বিএফআরআই) ও এর শাখা ও উপকেন্দ্রসমূহ *.বাংলাদেশ মৎস্য সম্পদ উন্নয়ন কেন্দ্র (বিএফডিসি) ও এর শাখা কেন্দ্রসমূহবেসরকারি সংস্থাসমূহ:দেশের বিভিন্ন এনজিও এর নানা ধরণের আত্মনির্ভরশীল উন্নয়নমূলক কর্মকাণ্ডের অন্যতম একটি হচ্ছে ফিশারীজ খাত। যেমন-বিভিন্ন মাছের একক ও মিশ্র চাষ, নার্সারি ব্যবস্থাপনা, বাওরে মৎস্যব্যবস্থাপনা ও উন্নয়ন ইত্যাদি। এই সকল খাতে ফিশারীজ গ্রাজুয়েটের কাজ করার সুযোগ রয়েছে। যেমন-*.বাংলাদেশরুরাল এ্যাডভান্সমেন্ট কমিটি (ব্রাক)*.প্রশিকা মানবিক উন্নয়ন কেন্দ্র*.গ্রামীণ ব্যাংক*.আরডিআরএস*.বাঁচতে শেখা*.টিএমএসএস*.এসোসিয়েশন ফর সোশ্যাল এডভান্সমেন্ট (আশা)#আন্তর্জাতিক সংস্থাসমূহ:বিভিন্ন আন্তর্জাতিক সংস্থা পৃথিবীর বিভিন্ন দেশের মতো আমাদের দেশেও ফিশারীজ বিষয়ক কার্যক্রম পরিচালনা করে থাকে যেখানে ফিশারীজ গ্রাজুয়েটের প্রয়োজনীয়তা রয়েছে। যেমন-*.ওয়ার্ল্ড ফিস সেন্টার*.ডিপার্টমেন্ট ফর ইন্টারন্যাশনাল ডেভেলপমেন্ট (ডিএফআইডি)*.ফাও (এফএও)*.ইউএনডিপি*.কেয়ার ইন্টারন্যাশনাল বাংলাদেশ*.কারিতাস বাংলাদেশ*.নেচার কনজারভেসন মুভমেন্ট*.এশিয়ান ওয়েটল্যান্ড ব্যুরো*.ডানিডা (ডিএএনআইডিএ)*.সোসাইটি ফর কনসারভেসন অব নেচার এন্ড এনভায়রনমেন্ট (এসসিওএনই)*.ইন্টারন্যাশনাল ইউনিয়ন ফর কনসারভেসন অব নেচার এন্ড ন্যাচারাল রিসোর্স (আইইউসিএন)*.সাউথ এশিয়া পার্টনারশিপ বাংলাদেশ(এসএপি)#ব্যক্তিগত খাতসমূহ:ব্যক্তি পর্যায়ে গড়ে ওঠা নিম্নে প্রদত্ত শিল্পসমূহে যোগদান করা যেতে পারে-*.মৎস্য খামার*.মৎস্য হ্যাচারি*.মৎস্য খাদ্য প্রস্তুতকারী কোম্পানিসমূহ*.মৎস্য প্রক্রিয়াজাতকরণ শিল্পসমূহ প্রকল্প ও প্রোগ্রামসমূহ: স্বল্প ও দীর্ঘ মেয়াদী বিভিন্ন প্রকল্প ও প্রোগ্রামে ফিশারীজ গ্রাজুয়েটের অংশ নেয়ার সুযোগ রয়েছে। যেমন-*.সরকারী অর্থায়নে বাস্তবায়িত বিভিন্ন প্রকল্প ও প্রোগ্রামসমূহ*.আন্তর্জাতিক সংস্থাসমূহের (ডিএফআইডি, ইউএস এইড, ডানিডা ইত্যাদি) উদ্যোগে বাস্তবায়িত প্রকল্প ও প্রোগ্রামসমূহ#ব্যাংকসমূহ:বিভিন্ন ব্যাংকের ফিশারীজ বিষয়ক ঋণপ্রদানের সেকশনে কাজকরার সুযোগ রয়েছে। যেমন-*.বাংলাদেশ কৃষি ব্যাংক*.রাজশাহী কৃষি উন্নয়ন ব্যাংক*.সোনালী ব্যাংক*.অগ্রণী ব্যাংক*.রূপালী ব্যাংক*.জনতা ব্যাংক*.সমবায় ব্যাংক*.কর্মসংস্থান ব্যাংক#আত্মকর্মসংস্থান:বি.এস-সি. ফিশারীজ (অনার্স) ডিগ্রী অর্জনের পর একজন ফিশারীজ গ্রাজুয়েটনিজেই তার কর্মসংস্থানের ব্যবস্থা করতে পারেন। অর্থ যোগানোর জন্য দেশের বিভিন্ন ব্যাংকসমূহে ঋণের সুযোগও রয়েছে। প্রথমে স্বল্প পরিসরে উদ্যোগ গ্রহণের মাধ্যমে নিজেকে প্রতিষ্ঠিত করার পর সে প্রচেষ্টাকেবৃহৎ পরিসরে বর্ধিত করে নিশ্চিতভাবেই অন্যদের কর্মসংস্থানের ব্যবস্থা করাও ফিশারীজ গ্রাজুয়েটের পক্ষে সম্ভব। যেমন-*.হ্যাচারি ও রেণু উৎপাদন*.পোনা ও টেবিল-সাইজ মৎস্য উৎপাদন*.মুক্তা উৎপাদন*.কাঁকড়া উৎপাদন*.বাহারি মাছের রেণু ওপোনা উৎপাদন*.মৎস্য খাদ্য উৎপাদন*.মৎস্য প্রক্রিয়াজাতকরণ*.মৎস্য সংশ্লিষ্ট সরঞ্জাম (যেমন- জাল) উৎপাদন*.চাষকৃত পুকুর/দিঘীতে মৎস্য শিকারপ্রতিযোগিতা আয়োজন*.মৎস্য পর্যটন (ফিশারীজ হটস্পট যেমন- সুন্দরবন, কাপ্তাই লেক, হাকালুকি হাওর, চলন বিল  মেঘনারইলিশ অভয়াশ্রম ইত্যাদি স্থানে ফিশারীজকে গুরুত্বদিয়ে পরিদর্শনের আয়োজন। আবার বিভিন্ন প্রতিষ্ঠানের পক্ষ থেকে কোর্স অনুযায়ী শিক্ষা সফরের আয়োজন)*.মৎস্য রোগ প্রবণ এলাকায় মৎস্য ক্লিনিক স্থাপন*.অনলাইন মৎস্য তথ্য কেন্দ্র পরিচালনােশের বাইরে:দেশের বাইরেও মৎস্য বিষয়ক বিভিন্নপ্রতিষ্ঠানে একজন ফিশারীজ গ্রাজুয়েট যোগ দিতে পারেন। যেমন-*.ইউরোপ, আমেরিকা, অস্ট্রেলিয়া, জাপান, চিন, কোরিয়া, থাইল্যান্ড,মালয়েশিয়া ইত্যাদি দেশের বিভিন্ন বিশ্ববিদ্যালয়ে বৃত্তিসহ উচ্চশিক্ষা (যেমন- এম.এস., এম.ফিল., পি-এইচ.ডি.,ডি.এস-সি. ইত্যাদি) গ্রহণের সুযোগ রয়েছে।*.পৃথিবীর বিভিন্ন দেশে বিশেষত গল্ফ ও আফ্রিকা অঞ্চলের দেশসমূহে মৎস্য চাষ ও মৎস্য প্রক্রিয়াজাতকরণ শিল্পে মৎস্য পেশাজীবীর চাহিদা রয়েছে।*.বিভিন্ন দেশে মৎস্য ও মৎস্য-জাত দ্রব্য আমদানি- রপ্তানি প্রতিষ্ঠানে যেমন কাজের সুযোগ রয়েছে তেমনি ক্ষুদ্র পরিসরে এজাতীয় প্রতিষ্ঠান স্থাপনের মাধ্যমে আত্মকর্মসংস্থানের ব্যবস্থা করা সম্ভব।",style: TextStyle(fontSize: 20,fontWeight: FontWeight.w400),),

            ],

          ),
        )
    );
  }
}
