import 'package:flutter/material.dart';
class PHARMACY extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
        backgroundColor: Colors.greenAccent,
        body: SafeArea(
          child: ListView(

            children: [
              SizedBox(height: 30,),

              Container(
                height: 200,
                decoration: BoxDecoration(
                  shape: BoxShape.rectangle,
                  image: DecorationImage(
                    image: AssetImage("images/math.jfif"),
                    fit: BoxFit.fill,
                  ),
                ),

              ),


              SizedBox(height: 30,),
              Text(" সাব্জেক্ট রিভিউ: গনিত, ক্যারিয়ার, উচ্চশিক্ষা, জব",style: TextStyle(fontSize: 24,fontWeight: FontWeight.bold),),
              SizedBox(height: 30,),
              Text(" ছোটবেলায় হয়তো দেখেছ যারা গণিত ভালো পারত, তারা একটু বেশি ভাব নিয়ে চলতো। আসলে গনিতের ডিমান্ড স্কুল কলেজ এবং ভার্সিটিতে যেমন রয়েছে তেমনি উন্নত ক্যারিয়ারে রয়েছে অপার সম্ভাবনা।\n\nছোটবেলা থেকে কি তোমার গণিতের প্রতি আগ্রহ বেশি? তুমি কি গণিতের লজিক সহজেই বুঝতে পারো? যদি উত্তর হ্যাঁ হয়, তাহলে এই লিখা তোমাকে নিয়ে। ",style: TextStyle(fontSize: 20,fontWeight: FontWeight.w400),),


              SizedBox(height: 30,),
              Text(" তার আগে কিছু কথা:",style: TextStyle(fontSize: 24,fontWeight: FontWeight.bold),),
              SizedBox(height: 30,),
              Text("”বীজগণিত, জ্যামিতি, ক্যালকুলাস, গাণিতিক বিশ্লেষণ, রৈখিক বীজগণিত, সংখ্যাতত্ত্ব, অন্তরীকরণ সমীকরণ ইত্যাদি” তুমি তোমার অনার্স লাইফের প্রথম এবং দ্বিতীয় বর্ষের পেয়ে থাকবে। তবে তোমাকে এসময় কিছু নন মেজর সাবজেক্ট পড়ানো হবে। নন মেজর সাবজেক্ট হিসেবে থাকবে পরিসংখ্যান, পদার্থবিজ্ঞান, কম্পিউটার বিজ্ঞানের মৌলিক বিষয়গুলো। গণিত বিভাগে চার বছরের BSC কোর্সে গণিতের মূল বিষয়ের পাশাপাশি করে ল্যাব কোর্স করতে হয়। ল্যাবে মূলত প্রোগ্রামিং /উচ্চতর ভাষার প্রোগ্রামিং শিখানো হয়। কিন্তু তোমাকে সারাসপ্তাহ ল্যাব করতে হবে না, সপ্তাহে মাত্র একদিন ল্যাব করতে হবে ।\n\nঅধিকাংশ ক্ষেত্রে গাণিতিক সমীকরণের সঠিক মান বের করা সম্ভব হয় না। এমন ক্ষেত্রে বিচ্যুতি নিয়ন্ত্রণে রেখে আসন্ন মান নির্ণয় করার হয় পদ্ধতিকে বলা হয় সংখ্যাসূচক বিশ্লেষণ। বড় বড় সমীকরণের হিসাব কষে বা ক্যালকুলেটরের মাধ্যমে মান নির্ণয় প্রায় আ।কাশ কুসুম চিন্তার মতো। তাই এমন ক্ষেত্রে কম্পিউটার প্রোগ্রামিংয়ের মাধ্যমে মান নির্ণয় কিভাবে করবে তা শেখানো হয়। অন্তরীকরণ গণিতের একটি গুরুত্বপূর্ণ শাখা। অন্তরীকরণ এর মাধ্যমে প্রচুর গাণিতিক সমস্যা সমাধান করা হয়। এ জন্য তৃতীয় বর্ষে সংখ্যাসূচক বিশ্লেষণবিষয়ক কিছু কোর্স পাবে। এছাড়া অত্যানুকূল ফলাফল নির্ণয় করার জন্য রৈখিক প্রোগ্রামিং কোর্স রয়েছে। বিমূর্ত গণিত হিসেবে বিমূর্ত বীজগণিত যেমন অ্যাবস্ট্রাক্ট অ্যালজেব্রা, গ্রুপ তত্ত্ব ইত্যাদি শিখানো হয়। ",style: TextStyle(fontSize: 20,fontWeight: FontWeight.w400),),



              SizedBox(height: 30,),
              Text("গণিতে উচ্চশিক্ষা: ",style: TextStyle(fontSize: 24,fontWeight: FontWeight.bold),),
              SizedBox(height: 30,),
              Text(" BSC শেষে তুমি পৃথিবীর top ranking University থেকে ডিগ্রি নিতে পারবে। অনেকেই জানো বিদেশে Masters /PhD করার জন্য GRE/ielts নামক একটা টেস্ট দিতে হয়। এই পরীক্ষার 50% প্রশ্নই  maths related হয়ে থাকে। গণিতে দক্ষতা থাকলে GRE এর Quantitative এবং Integrated reasoning part খুব দ্রুত নির্ভুলভাবে সমাধান করতে পারবে। গণিতে BSC সম্পন্ন করার পর তুমি অনেকগুলো বিষয়কে MSC এর জন্য বেছে নিতে পারবে।\n\n ম্যাথমেটিক্স ডিপার্টমেন্ট নেই এমন একটি ভার্সিটির নাম কি তোমরা বলতে পারবে? আমার মনে হয় তোমরা পারবে না। কারণ পৃথিবীর সব ভার্সিটিতে ম্যাথমেটিক্স সাবজেক্ট থাকে। তাহলে উচ্চশিক্ষা নিয়ে কেন এত চিন্তা। ম্যাথমেটিক্স পড়ে তুমি খুব সহজেই উচ্চশিক্ষার জন্য দেশ এবং দেশের বাইরে পড়ালেখা করতে পারবে। অর্থাৎ গণিতে উচ্চশিক্ষার জন্য রয়েছে অপার সম্ভাবনার দুয়ার।",style: TextStyle(fontSize: 20,fontWeight: FontWeight.w400),),



              SizedBox(height: 30,),
              Text("শিক্ষকতা: ",style: TextStyle(fontSize: 24,fontWeight: FontWeight.bold),),
              SizedBox(height: 30,),
              Text(" শিক্ষকতা\n\n ব্যাংক  \n\n BCS: \n\n ",style: TextStyle(fontSize: 20,fontWeight: FontWeight.w400),),

            ],

          ),
        )
    );
  }
}
