import 'package:flutter/material.dart';
class SOCIOLOGY extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
        backgroundColor: Colors.greenAccent,
        body: SafeArea(
          child: ListView(

            children: [
              SizedBox(height: 30,),

              Container(
                height: 200,
                decoration: BoxDecoration(
                  shape: BoxShape.rectangle,
                  image: DecorationImage(
                    image: AssetImage("images/sociologym.PNG"),
                    fit: BoxFit.fill,
                  ),
                ),
              ),


              SizedBox(height: 30,),
              Text("কেন পড়বেন সমাজবিজ্ঞানে : ",style: TextStyle(fontSize: 24,fontWeight: FontWeight.bold),),
              SizedBox(height: 30,),
              Text(" সমাজ বা দলের বৈজ্ঞানিক আলোচনা বিজ্ঞান সমাজবিজ্ঞান। সমাজবিজ্ঞানের জ্ঞান একজন শিক্ষার্থীকে এমন ভাবে প্রস্তুত করে যাতে সে, সমস্যাগ্রস্ত ব্যক্তির মনো- সামাজিক সমস্যা দূর করেতে সমর্থ হয়। এছাড়া সমস্যাগ্রস্ত দল, পরিবার ও সম্প্রদায়ের এমনভাবে সাহায্য করেন যেন তারা নিজেরাই নিজেদের সমস্যা সমাধান করতে পারে। যে কারণে সমাজবিজ্ঞানের শিক্ষার্থীরা সমাজের ডাক্তার হিসেবে পরিচিতি লাভ করেন। সমাজকর্মী হিসেবে পেয়ে থাকেন বিশেষ মর্যাদা।সামাজিক সেবা প্রদান পরিচালনা, উন্নয়নশীল নীতি ও কর্মসূচি বাস্তবায়নে কাজ করার সুযোগ হয়। কাজের মাধ্যমে সমাজকর্মী হিসেবে দেশে- বিদেশে সমাদৃত হন। কেউ কেউ পেয়ে যান জাতীয় ও আন্তর্জাতিক পর্যায়ের খ্যাতি। কাজের সুবাদে ঘুরে বেড়াতে পারেন পৃথিবীর এক প্রান্ত থেকে আর এক প্রান্তে।\n এ বিষয়ে পড়াশুনা শেষে আছে বিভিন্ন কর্মের হাতছানি। সমাজবিজ্ঞানে ডিগ্রীধারী শিক্ষার্থীদের রয়েছে সরকারের সমাজকল্যাণ মন্ত্রণালয়, সমাজসেবা অধিদপ্তরের পাশাপাশি দাতব্য এবং অন্যান্য বেসরকারি সংস্থায় পেশাগতভাবে কাজ করার সুযোগ।",style: TextStyle(fontSize: 20,fontWeight: FontWeight.w400),),



              SizedBox(height: 30,),
              Text("কাজের ধরণঃ  ",style: TextStyle(fontSize: 24,fontWeight: FontWeight.bold),),
              SizedBox(height: 30,),
              Text(" গবেষণা, উন্নয়ন, প্রোগ্রাম, শিক্ষা, স্বাস্থ্য ও পুষ্টি বিভাগ, মানবসম্পদ উন্নয়ন। এছাড়া সোশ্যাল গবেষণা প্রতিষ্ঠানের অধীনে গবেষক, সহকারী গবেষক, মাঠ গবেষণা পর্যবেক্ষক, পর্যবেক্ষক, গবেষণা পদ্ধতি উন্নয়নকারী, তথ্য সংগ্রহকারী এবং গবেষণা প্রতিবেদক হিসেবেও কাজ করতে পারেন।একজন সমাজবিজ্ঞানের শিক্ষার্থী আন্তর্জাতিক প্রতিষ্ঠানে যেমন ইউএনডিপি, ইউনেসকো, ইউনিসেফে চাকরি করে আন্তর্জাতিক স্কেলে বেতন প্রাপ্ত হন।\n *বিভিন্ন বিশ্ববিদ্যালয় পড়ুয়া সমাজবিজ্ঞানের স্টুডেন্টরা জানতে চায়,সমাজবিজ্ঞান পড়লে চাকরির ক্ষেত্র কেমন? \n তাই সমাজবিজ্ঞানের নবীন পড়ুয়াদের জন্য এই লেখা। সমাজকে বৈজ্ঞানিক দৃষ্টিকোণ থেকে জানার জন্য সমাজবিজ্ঞান একটি অসাধারণ ক্ষেত্র। সমাজবিজ্ঞান পাঠ করলে সমাজের বিভিন্ন দিক সম্পর্কে, পরিবর্তনশীল সমাজ ব্যবস্থা সম্পর্কে সম্যক জ্ঞান লাভ করা যায়। এখন আসল কথা হলো জ্ঞান নয়, সমাজবিজ্ঞান পড়লে ভবিষ্যতে কাজের সুযোগ কেমন, কোন কোন ক্ষেত্রে ক্যারিয়ার গড়ার সুযোগ আছে। নবীনদের জন্য বলতে চাই, সমাজবিজ্ঞান পড়ে ক্যারিয়ার গড়ার অনেক সুযোগ আছে। প্রথমে বিসিএস সহ প্রায় সকল সরকরি চাকরির দুয়ার খোলা, বিসিএস এ অন্যান্য সাবজেক্টের তুলনায় সমাজবিজ্ঞানের স্টুডেন্টসদের টিকতে বেশি দেখা যায়। বাংলাদেশ ব্যাংক সকল সরকারি ব্যাংকে চাকরির সুযোগ আছে। যারা স্কলারশিপ নিয়ে বিদেশ যেতে চায়, তাদের জন্য অনেক ভালো সুযোগ আছে। সেক্ষেত্রে দরকার ভালো সিজিপিএ, ভালো ielts স্কোর, এবং দুই একটি রিসার্চ পাবলিকেশন থাকলে সম্ভাবনা আরো বেড়ে যাবে। দেশি-বিদেশি এনজিওতে এবং জাতিসংঘের বিভিন্ন অঙ্গ প্রতিষ্ঠানে সমাজবিজ্ঞানের স্টুডেন্টদের ভালো চাকরির সুযোগ আছে, সেক্ষেত্রে কম্পিউটার এবং ইংরেজিতে ভালো দক্ষতা থাকতে হবে, গবেষণার জ্ঞান ও অনেক উপকারে আসবে। এর সাথে বিভিন্ন প্রতিষ্ঠানে কর্মরত কর্মীদের সাথে যোগাযোগ স্থাপন করতে পারলে সেটি অনেক কাছে দেয়। কেউ যদি শিক্ষকতায় আসতে চায় তার জন্য বিশ্ববিদ্যালয়, সরকারি-বেসরকারি কলেজ, প্রাইভেট ভার্সিটিতে ভালো সুযোগ আছে।",style: TextStyle(fontSize: 20,fontWeight: FontWeight.w400),),









            ],

          ),
        )
    );
  }
}
