import 'package:flutter/material.dart';
class Urban extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
        backgroundColor: Colors.greenAccent,
        body: SafeArea(
          child: ListView(

            children: [
              SizedBox(height: 30,),

              Container(
                height: 200,
                decoration: BoxDecoration(
                  shape: BoxShape.rectangle,
                  image: DecorationImage(
                    image: AssetImage("images/urban.jfif"),
                    fit: BoxFit.fill,
                  ),
                ),

              ),


              SizedBox(height: 30,),
              Text("নগর ও অঞ্চল পরিকল্পনা বিভাগ (URP) ",style: TextStyle(fontSize: 24,fontWeight: FontWeight.bold),),
              SizedBox(height: 30,),
              Text(" বাংলাদেশের অধিকাংশ মানুষের কাছেই ইউ আর পি অচেনা একটি বিষয় এবং খুব স্বাভাবিক ভাবেই তথাকথিত পেছনের দিকের একটি বিষয়। কিন্তু আসলেই দেখা যাক বিষয়টিতে কি পড়ানো হয় বা এর ভবিষ্যত কি রকম।\n\n নগর ও অঞ্চল পরিকল্পনা বিষয়টি মূলত পূরকৌশল, স্থাপত্য বিদ্যা এবং সামাজিক বিজ্ঞানের সংমিশ্রণ। কি, অদ্ভুত মনে হচ্ছে? আসলে আমাদের দেশে স্থপতিরা স্থাপনার নকশা করে, পুরকৌশলীরা সে স্থাপনা নির্মাণ করে। কিন্তু সামগ্রিকভাবে সে স্থাপনাগুলো কোন নগরের জন্য উল্লেখযোগ্য কোন ভুমিকা রাখছে কি না বা সে সকল স্থাপনাগুলোর আদৌ কোন দরকার আছে কিনা বা উন্নয়নের ক্ষেত্রে একটি নগরের এবং নাগরিকদের কি কি দরকার সেটা দেখা হয় না। সেজন্যেই বাইরের অন্যান্য দেশের মত বাংলাদেশেও পরিকল্পনা বিষয়ে দক্ষতা বাড়ানোর জন্য বর্তমানে বিভিন্ন বিশ্ববিদ্যালয়গুলোতে পরিকল্পনা বিষয়ে শিক্ষার ব্যবস্থা করা হচ্ছে।\n\n এখন দেখা যাক এ বিষয়ে কি কি নিয়ে পড়াশুনা করতে হয়। প্রথমত পুরকৌশল এর প্রাথমিক কিছু কোর্স করানো হয়। পাশাপাশি স্থাপত্যবিদ্যা নিয়েও বেশ ঘাটাঘাটি করতে হয়। এ বিভাগে পড়তে হলে আকাআকির হাতটা ভালো হলে সুবিধা হয়, নাহলেও তেমন একটা অসুবিধা হয় না। কারণ পরবর্তিতে কম্পিউটার সফটওয়ার নিয়ে প্রচুর কাজ করতে হয়, যেমন- গ্রাফিক্সের জন্য প্রয়োজনীয় সকল সফটওয়্যার, জি আই এস, ত্রিমাত্রিক কাজ ইত্যাদি করতে হয়। এছাড়াও প্ল্যানিং শিক্ষার নিজস্ব কিছু কোর্স রয়েছে যার মাধ্যমে শেখা যায় কিভাবে সামগ্রিকভাবে বড় পরিসরে নগর, নাগরিক এবং দেশের জন্য পরিকল্পনা করা যায়।\n\n এ বিষয়ের সবচেয়ে ডায়নামিক দিকটি হল চাইলে কেউ কারিগরি দিকেও কাজ করতে পারে অর্থাৎ প্রকৌশলীদের সাথে বা সামাজিক ক্ষেত্রেও উন্নয়নের কাজ করতে পারবে।\n\n সবচেয়ে গুরুত্বপূর্ণ প্রশ্নঃ চাকরির বাজারে এ বিষয়ে গ্র্যাজুয়েটদের মূল্য কতটুকু? পরিকল্পনা বিষয়ে এ দেশে গ্র্যাজুয়েটদের সংখ্যা কম হওয়ার কারণে এ বিষয় সম্পর্কে অনেকেই অবগত না। তাহলে বলে রাখি যে বর্ত্মানে দেশে পরিকল্পনাবিদদের চাহিদা দিন দিন বাড়ছে এবং আগামী ২০২০ সালের মধ্যে এর চাহিদা ১৬% বৃদ্ধি পাবে। চাকরির ক্ষেত্র হলঃ এনজিও, বিভিন্ন কন্সট্রাকশন ফার্ম, বিভিন্ন কন্সাল্টেন্সী ফার্ম ইত্যাদি। সরকারী চাকরির ক্ষেত্রে প্রত্যেকটি মহানগরের উন্নয়ন কর্তৃপক্ষ, প্রত্যেকটি পৌরসভা এবং পরিকল্পনা কমিশনে নগর পরিকল্পনাবিদের আসনে আসীন হতে পারবে।\n\n  উচ্চশিক্ষার ক্ষেত্রেও অনেক সুবিধা রয়েছে। কেউ চাইলেই পুরকৌশলের এবং স্থাপত্য বিদ্যার বিভিন্ন শাখায় উচ্চ শিক্ষা নিতে পারবে। এ বিষয়ে মাস্টার্স এবং পিএইচডি করার ক্ষেত্রে ফান্ডিংও বেশ ভালো পাওয়া যায়। বিভিন্ন দেশে দক্ষ পরিকল্পনাবিদের চাহিদা প্রচুর।",style: TextStyle(fontSize: 20,fontWeight: FontWeight.w400),),


              SizedBox(height: 30,),
              Text(" শেষ কথাঃ",style: TextStyle(fontSize: 24,fontWeight: FontWeight.bold),),
              SizedBox(height: 30,),
              Text(" কেউ যদি দূর্ভাগ্যক্রমে (!!!) এ বিষয়ে ভর্তি হতে হয় তাহলে মন খারাপ কর না। তোমার ভবিষ্যত আসলেই ভালো হবে এবং সবচেয়ে বড় বিষয় কখনো থেমে থাকতে হবে না। যারা যারা কারিগরি এবং ক্রিয়েটিভ শিক্ষার অদ্ভুত এক মেলবন্ধনে নিজেকে বাধতে চাও তাদেরকে নগর ও অঞ্চল পরিকল্পনা বিভাগে স্বাগতম।",style: TextStyle(fontSize: 20,fontWeight: FontWeight.w400),),


            ],

          ),
        )
    );
  }
}
